package BattleWord;

import java.awt.*;
import java.awt.event.*;
import javax.swing.*;
import javax.swing.event.*;

public class Z_Ex{
	public static void main(String[]args){
		
		// 정점이 42, 42 // 

/***************************************************************************
 * [우측 방향] :: 이렇게 눌려진 경우에는 홀수, 즉 가로 낱말이 존재하는 경우 그것의 번호를 보여준다.
 
		int x, y1, y2;
		for(int i = 42; i <= 84; i++){
			x = i;
			y1 = (42 - x) + 42;
			y2 = (42 + x) - 42;
			
			System.out.println("x : " + x);
			System.out.println(y1 + " < " + "y" + " < " + y2);
			System.out.println("\n");
		}
***************************************************************************/
		
		
		
/***************************************************************************
 * [좌측 방향] :: 이렇게 눌려진 경우에는 홀수, 즉 가로 낱말이 존재하는 경우 그것의 번호를 보여준다.
		int x, y1, y2;
		for(int i = 42; i >= 0; i--){
			x = i;
			y1 = (42 + x) - 42;
			y2 = (42 - x) + 42;
			
			System.out.println("x : " + x);
			System.out.println(y1 + " < " + "y" + " < " + y2);
			System.out.println("\n");
		}
***************************************************************************/



/***************************************************************************
 * [상측 방향] :: 이렇게 눌려진 경우에는 짝수, 즉 세로 낱말이 존재하는 경우 그것의 번호를 보여준다.		
		int x1, x2, y;
		for(int i = 42; i >= 0; i--){
			y = i;
			x1 = (42 + y) - 42;
			x2 = (42 - y) + 42;
			
			System.out.println("y : " + y);
			System.out.println(x1 + " < " + "x" + " < " + x2);
			System.out.println("\n");
		}
***************************************************************************/
		
		
		
/***************************************************************************
 * [하측 방향] :: 이렇게 눌려진 경우에는 짝수, 즉 세로 낱말이 존재하는 경우 그것의 번호를 보여준다.
 
		int x1, x2, y;
		for(int i = 42; i <= 84; i++){
			y = i;
			x1 = (42 - y) + 42;
			x2 = (42 + y) - 42;
			
			System.out.println("y : " + y);
			System.out.println(x1 + " < " + "x" + " < " + x2);
			System.out.println("\n");
		}
***************************************************************************/		
	}
}
